package com.uzum.java.homework.lesson4;

public class resourceHomework3_1 {

    static String TEXT = "— Она несла в руках отвратительные, тревожные желтые цветы. Черт их знает, как их зовут, но они первые почему-то появляются в Москве. И эти цветы очень отчетливо выделялись на черном ее весеннем пальто. Она несла желтые цветы! Нехороший цвет. Она повернула с Тверской в переулок и тут обернулась. Ну, Тверскую вы знаете? По Тверской шли тысячи людей, но я вам ручаюсь, что увидела она меня одного и поглядела не то что тревожно, а даже как будто болезненно. И меня поразила не столько ее красота, сколько необыкновенное, никем не виданное одиночество в глазах!\n" +
            "Повинуясь этому желтому знаку, я тоже свернул в переулок и пошел по ее следам. Мы шли по кривому, скучному переулку безмолвно, я по одной стороне, а она по другой. И не было, вообразите, в переулке ни души. Я мучился, потому что мне показалось, что с нею необходимо говорить, и тревожился, что я не вымолвлю ни одного слова, а она уйдет, и я никогда ее более не увижу.\n" +
            "И, вообразите, внезапно заговорила она:\n" +
            "— Нравятся ли вам мои цветы?Я отчетливо помню, как прозвучал ее голос, низкий довольно-таки, но со срывами, и, как это ни глупо, показалось, что эхо ударило в переулок и отразилось от желтой грязной стены. \n" +
            "Я быстро перешел на ее сторону и, подходя к ней, ответил:\n" +
            "— Нет.\n" +
            "Она поглядела на меня удивленно, а я вдруг, и совершенно неожиданно, понял, что я всю жизнь любил именно эту женщину! Вот так штука, а? Вы, конечно, скажете, сумасшедший?\n" +
            "— Ничего я не говорю, — воскликнул Иван и добавил: — Умоляю, дальше!\n" +
            "И гость продолжал:\n" +
            "— Да, она поглядела на меня удивленно, а затем, поглядев, спросила так:\n" +
            "— Вы вообще не любите цветов?\n" +
            "В голосе ее была, как мне показалось, враждебность. Я шел с нею рядом, стараясь идти в ногу, и, к удивлению моему, совершенно не чувствовал себя стесненным.\n" +
            "— Нет, я люблю цветы, только не такие, — сказал я.\n" +
            "— А какие?\n" +
            "— Я розы люблю.\n" +
            "Тут я пожалел о том, что это сказал, потому что она виновато улыбнулась и бросила свои цветы в канаву. Растерявшись немного, я все-таки поднял их и подал ей, но она, усмехнувшись, оттолкнула цветы, и я понес их в руках.Так шли молча некоторое время, пока она не вынула у меня из рук цветы, не бросила их на мостовую, затем продела свою руку в черной перчатке с раструбом в мою, и мы пошли рядом.\n" +
            "— Дальше, — сказал Иван, — и не пропускайте, пожалуйста, ничего.\n" +
            "— Дальше? — переспросил гость. — Что же, дальше вы могли бы и сами угадать. — Он вдруг вытер неожиданную слезу правым рукавом и продолжал: — Любовь выскочила перед нами, как из-под земли выскакивает убийца в переулке, и поразила нас сразу обоих! Так поражает молния, так поражает финский нож! Она-то, впрочем, утверждала впоследствии, что это не так, что любили мы, конечно, друг друга давным-давно, не зная друг друга, никогда не видя, и что она жила с другим человеком... и я там, тогда... с этой, как ее...\n" +
            "— С кем? — спросил Бездомный.\n" +
            "— С этой... ну... с этой... ну... — ответил гость и защелкал пальцами.\n" +
            "— Вы были женаты?\n" +
            "— Ну да, вот же я и щелкаю... На этой... Вареньке... Манечке... нет, Вареньке... еще платье полосатое... музей... Впрочем, я не помню.Так вот она говорила, что с желтыми цветами в руках она вышла в тот день, чтобы я наконец ее нашел, и что, если бы этого не произошло, она отравилась бы, потому что жизнь ее пуста.Да, любовь поразила нас мгновенно. Я это знал в тот же день, уже через час, когда мы оказались, не замечая города, у Кремлевской стены на набережной. Мы разговаривали так, как будто расстались вчера, как будто знали друг друга много лет. На другой день мы сговорились встретиться там же, на Москве-реке, и встретились. Майское солнце светило нам. И скоро, скоро стала эта женщина моею тайною женой.";



}
